a=float(input('Введите значение стороны a: '))
b=float(input('Введите значение стороны b: '))
c=float(input('Введите значение стороны c: '))
if (a+b>c) and (a+c>b) and (b+c>a):
    print('Треугольник существует')
    if a==b and b==c:
        print('Треугольник равносторонний')
    elif a==c or b==c or a==b:
        print('Треугольник равнобедренный')
    else:
        print('Треугольник разносторонний')
    p=a+b+c
    print(f'Периметр треугольника: {p:2f}')
else:
    print('Треугольника не существует')