x=float(input('Введите первое число: '))
y=float(input('Введите второе число: '))
print('1 - сложение')
print('2 - вычитание')
print('3 - умножение')
print('4 - деление')
n=int(input('Выберите номер операции (1-4): '))
if n==1:
    print(f'Результат: {x+y}')
elif n==2:
    print(f'Результат: {x-y}')
elif n==3:
    print(f'Результат: {x*y}')
elif n==4:
    if y!=0:
        print(f'Результат: {x/y}')
    else:
        print('Ошибка выполнения операции!')
else:
    print('Такого номера операции не существует')    